# PANDAS

Pandas is a Python library.

A lot of numpy methods are applicable here, as Pandas is built over Numpy.

Pandas is used to analyze data.

In [1]:
import pandas as pd;
print(pd.__version__);

1.2.4

In [2]:
a=pd.Series([10,20,30],index=['a','b','c']);
# may or may not give index, by default 0,1,2,3...
# Series only hold 1D array

print(a.values);

[10 20 30]

In [3]:
print(type(a.values));

<class 'numpy.ndarray'>

In [4]:
print(a.index);

Index(['a', 'b', 'c'], dtype='object')

In [7]:
print(a['a']);

10

In [8]:
print(a['a':'c']);

a    10
b    20
c    30
dtype: int64

In [9]:
grads_dict={'A':4,'B':3,'C':2};
grads=pd.Series(grads_dict);
# grads is a Series object
print(grads);

A    4
B    3
C    2
dtype: int64

In [11]:
grads

A    4
B    3
C    2
dtype: int64

In [17]:
grads[0:2]

A    4
B    3
dtype: int64

#### IF WANT TO PRINT ANY OBJECT, WRITE OBJECT NAME WITHOUT PRINT AND WITHOUT ; THEN SHIFT + ENTER

In [33]:
marks_dict={"Tushar":100,"Kunal":97,"Kartike":"99"}
marks=pd.Series(marks_dict);

print(marks);

Tushar     100
Kunal       97
Kartike     99
dtype: object

In [19]:
marks

Tushar     100
Kunal       99
Kartike     97
dtype: object

In [42]:
grads_dict={"Tushar":"A","Kunal":"C","Kartike":"B"}
grads=pd.Series(grads_dict);

print(grads);

Tushar     A
Kunal      C
Kartike    B
dtype: object

In [43]:
d=pd.DataFrame({'Marks':marks,'Grades':grads})
print(d);

        Marks Grades
Tushar    100      A
Kunal      97      C
Kartike    99      B

In [44]:
d.T

       Tushar Kunal Kartike
Marks     100    97      99
Grades      A     C       B

In [45]:
d

        Marks Grades
Tushar    100      A
Kunal      97      C
Kartike    99      B

In [46]:
d.values

array([[100, 'A'],
       [97, 'C'],
       ['99', 'B']], dtype=object)

In [48]:
d.values[2,0]

'99'

In [49]:
d.columns

Index(['Marks', 'Grades'], dtype='object')

In [57]:
a={"a":2};
b={"a":"Good","b":"Bad"}
c=pd.DataFrame({"Marks":a,"Remarks":b})

In [58]:
c

   Marks Remarks
a    2.0    Good
b    NaN     Bad

In [61]:
c.fillna(0)

   Marks Remarks
a    2.0    Good
b    0.0     Bad

In [62]:
d

        Marks Grades
Tushar    100      A
Kunal      97      C
Kartike    99      B

In [63]:
d[0:2]

       Marks Grades
Tushar   100      A
Kunal     97      C

In [8]:
from sklearn.impute import SimpleImputer
import pandas as pd
dataset=pd.read_csv("cars.csv")
dataset.head()

  Car;MPG;Cylinders;Displacement;Horsepower;Weight;Acceleration;Model;Origin
0  STRING;DOUBLE;INT;DOUBLE;DOUBLE;DOUBLE;DOUBLE;...
1  Chevrolet Chevelle Malibu;18.0;8;307.0;130.0;3...
2  Buick Skylark 320;15.0;8;350.0;165.0;3693.;11....
3  Plymouth Satellite;18.0;8;318.0;150.0;3436.;11...
4  AMC Rebel SST;16.0;8;304.0;150.0;3433.;12.0;70;US

In [9]:
dataset.tail()

    Car;MPG;Cylinders;Displacement;Horsepower;Weight;Acceleration;Model;Origin
402  Ford Mustang GL;27.0;4;140.0;86.00;2790.;15.6;...
403  Volkswagen Pickup;44.0;4;97.00;52.00;2130.;24....
404  Dodge Rampage;32.0;4;135.0;84.00;2295.;11.6;82;US
405    Ford Ranger;28.0;4;120.0;79.00;2625.;18.6;82;US
406     Chevy S-10;31.0;4;119.0;82.00;2720.;19.4;82;US

In [10]:
from sklearn.impute import SimpleImputer
import pandas as pd
dataset=pd.read_csv("covid.csv")
dataset.head()

,Date_reported,Country_code,Country,WHO_region,New_cases,Cumulative_cases,New_deaths,Cumulative_deaths
0,2020-01-03,AF,Afghanistan,EMRO,0,0,0,0
1,2020-01-04,AF,Afghanistan,EMRO,0,0,0,0
2,2020-01-05,AF,Afghanistan,EMRO,0,0,0,0
3,2020-01-06,AF,Afghanistan,EMRO,0,0,0,0
4,2020-01-07,AF,Afghanistan,EMRO,0,0,0,0

In [11]:
dataset.tail()

,Date_reported,Country_code,Country,WHO_region,New_cases,Cumulative_cases,New_deaths,Cumulative_deaths
154519,2021-10-11,ZW,Zimbabwe,AFRO,34,131796,1,4637
154520,2021-10-12,ZW,Zimbabwe,AFRO,79,131875,6,4643
154521,2021-10-13,ZW,Zimbabwe,AFRO,141,132016,2,4645
154522,2021-10-14,ZW,Zimbabwe,AFRO,92,132108,3,4648
154523,2021-10-15,ZW,Zimbabwe,AFRO,143,132251,7,4655